app/controllers/v1/invoices_controller.rb

    def create
      @invoice = current_user.invoices.create!(invoice_params)
---
INSERT INTO "invoices" ("date", "number", "document_type", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"