app/auth/authorize_api_request.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def user
    # check if user is in the database
    # memoize user object
    @user ||= if decoded_auth_token
                User.find(decoded_auth_token[:user_id]) || Admin.find(decoded_auth_token[:user_id])