app/auth/authenticate_user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@factura.co"], ["LIMIT", 1]]
---
  def user
    user = User.find_by(email: email) || Admin.find_by(email: email)